def book_list_view(library):
    for name in library:
        print(name)


def add_book(title, author, year):
    if title in library:
        if input("Книга с таким названием уже существует, хотите обновить информацию о ней? ").lower().strip() == "да":
            library[title] = {'Автор': author, 'Год издания': year, "Наличие": None}
        return "Информация о книге обновлена"
    library[title] = {'Автор': author, 'Год издания': year, "Наличие": None}
    return "Информация о книге добавлена"


library = {"Капитанская дочка": {"Автор": "А.С.Пушкин", "Год издания": 1836, "Наличие": "В наличии"},
           "Мцыри": {"Автор": "М.Ю.Лермонтов", "Год издания": 1840, "Наличие": "Нет в наличии"},
           "Крестный отец": {"Автор": "Марио Пьюзо", "Год издания": 1969, "Наличие": "В наличии"}}

print(add_book("Мцыри", "М.Ю.Лермонтов", 1999))
book_list_view(library)
